# Задача 2: Найдите сумму цифр трехзначного числа. 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

numm = int(input("Введите 3-х значное число: "))
summ = (numm % 10) + (numm % 100 //10) +(numm // 100)
print(summ)