# Задача 2: Найдите сумму цифр трехзначного числа. 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# numm = int(input("Введите 3-х значное число: "))
# summ = (numm % 10) + (numm % 100 //10) +(numm // 100)
# print(summ)


# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?
# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10

# s = int(input("Введите Кол-во Журавликов: "))
# print((s//6), ((s//6)*4), (s//6))

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no


b = (input("Введите 6-ти значный номер билета: "))
s1 = int(b[0]) + int(b[1]) + int(b[2])
s2 = int(b[3]) + int(b[4]) + int(b[5])
if s1 == s2 :
    print("Счастливый")
else:
    print("Не повезло")


