# Задача 1:
# Напишите программу, которая считывает число N с клавиатуры и выводит на экран сумму чисел от 1 до N.


# N = int(input('Введите чило: '))
# i = 1
# summ = 0
# while i <= N:
#     summ = summ + i
#     i = i + 1
# print(summ)


# # Задача 2:
# # Напишите программу, которая считывает строку с клавиатуры и выводит на экран количество гласных букв в этой строке.

# word = input('Введите строку: ')
# a = []
# for i in word:


# Напишите программу, которая запрашивает у пользователя целое число N, а затем выводит на экран все числа от 1 до N, включая N.

# N = int(input('Введите число: '))
# i = 1
# A = []
# while i <= N:
#     A.append(i)
#     i += 1
# print(A)

# Пользователь вводит целое число N. Вам нужно найти сумму всех нечетных чисел от 1 до N (включительно) и вывести ее на экран.

# N = int(input('Введите число: '))
# i = 1
# summ = 0
# for i in range(1, N + 1):
#     if i % 2 != 0:
#         summ += i
           
# print(summ)




















